# TilePerColumn Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Tile..::..TilePerColumn Property
Tile Class See Also
---
The property labeled "Every" from the "Tile" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string TilePerColumn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property TilePerColumn As String
	Get
```

Visual C++
---
```text
public:
static property String^ TilePerColumn {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyInteger" within the range of "0, 50".
# See Also
Tile Class
Autodesk.Revit.DB.Visual Namespace